---
title: FabricationItemFolder
classe: Autodesk.Revit.DB.FabricationItemFolder
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# FabricationItemFolder

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `fabricationItemFolder.IsValidObject` | Boolean |
| `String Name { get; }` | `fabricationItemFolder.Name` | String |
| `Void Dispose()` | `fabricationItemFolder.Dispose()` | Void |
| `IList<FabricationItemFile> GetItemFiles()` | `fabricationItemFolder.GetItemFiles()` | IList<FabricationItemFile> |
| `IList<FabricationItemFolder> GetSubFolders()` | `fabricationItemFolder.GetSubFolders()` | IList<FabricationItemFolder> |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```